ATsupportum/src/InformationRegisters/ПриоритетЗаявок_ат/ПриоритетЗаявок_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПриоритетЗаявок_ат</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/ИсторияСтатусовЗаявок_ат/ИсторияСтатусовЗаявок_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияСтатусовЗаявок_ат</name>
  <comment>!!!!!HOTFIX</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок_ат</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУстановкиСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.Заявка_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСтатуса</name>
    <type>
      <types>EnumRef.ТипыСтатусов_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/Enums/СтатусыЗаявок_ат/СтатусыЗаявок_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок_ат</name>
  <enumValues>
    <name>Пожелание</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Зарегистрирована</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииОтвета</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаВнутреннемСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииРелиза</name>
  </enumValues>
  <enumValues>
    <name>НаПриемке</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/InformationRegisters/ПриоритетЗаявок_ат/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПерезаполнитьПриоритеты(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииПриоритетов", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, "Приоритеты всех Заявок будут пересчитаны. Продолжить?", РежимДиалогаВопрос.ДаНет,
		10, КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПерезаполненииПриоритетов(Результат, ПередаваемыеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПерезаполнитьПриоритеты_Сервер();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезаполнитьПриоритеты_Сервер()
	
	НаборЗаписей = РегистрыСведений.ПриоритетЗаявок_ат.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсторияСтатусовЗаявок_атСрезПоследних.Ссылка КАК Ссылка,
		|	ИсторияСтатусовЗаявок_атСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ИсторияСтатусовЗаявок_ат.СрезПоследних(, НЕ Ссылка.ПометкаУдаления) КАК ИсторияСтатусовЗаявок_атСрезПоследних
		|ГДЕ
		|	(ИсторияСтатусовЗаявок_атСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок_ат.Зарегистрирована)
		|			ИЛИ ИсторияСтатусовЗаявок_атСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок_ат.НаСогласовании))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИсторияСтатусовЗаявок_атСрезПоследних.Ссылка.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Планирование_Сервер_ат.УстановитьПриоритетЗаявки(Выборка.Ссылка, Выборка.Статус);
		
	КонецЦикла;
	
КонецПроцедуры
